clear();
kinematic_calc_trans();
T2 = M_out; % N m
%% Контактная выносливость
K_d = 770;
psi_bd = 0.33;
K_Hbet = 1.025;
% допускаемое контактное напряжение
sig_Hlim = 2 * H_HB + 70; % MPa
S_H = 1.1; % S_Hmin
Z_N = 1;
sig_HP = 0.9 * sig_Hlim * Z_N / S_H;
% диаметр начальной окружности шестерни
d_w1 = K_d * ((T2 * K_Hbet) / (psi_bd * sig_HP^2) * (u + 1) / u^2)^(1/3);
% межосевое расстояние
K_a = 495;
psi_ba = 2 * psi_bd / (u + 1);
a_w = K_a * (u + 1) * ((T2 * K_Hbet) / (u^2 * psi_ba * sig_HP^2))^(1/3);
% прогноз по диаметру начальной окружности шестерни
m(1) = d_w1 / z(1);

%% Выносливость зубьев при изгибе
% допускаемое изгибное напряжение
sig_0Flimb = 1.75 * H_HB;
Y_N = 1;
sig_FP = 0.4 * sig_0Flimb * Y_N;
Y_FS = 3.91;
% прогноз по коэффициенту относительной ширины венца
K_m = 14;
K_Fbet = 1.025;
m(2) = K_m * ((T2 * K_Fbet * Y_FS) / (u * z(1)^2 * psi_bd * sig_FP))^(1/3);
% прогноз по межосевому расстоянию
K_ma = 1400;
b_w = psi_ba * a_w;
m(3) = K_ma * (T2 * (u + 1) * Y_FS) / (u * a_w * b_w * sig_FP);