clear();
shaft_data();
base_data();
T2 = 1000 * M_out; % N mm
%% Расчет на прочность штифтового соединения
tau_sl_lim = 60;
d_pin_min = 1.13 * sqrt(T2 / d_sh / tau_sl_lim);

%% Расчет шпонки на прочность
% шпонка сегментная
LuT = [
    3,      4,      5,      6,      7,      8,      9,      10;
    1.0,    1.5,    2.0,    2.0,    2.5,    3.0,    3.0,    3.0;
    1.4,    2.6,    2.6,    3.7,    3.7,    5.0,    5.0,    6.5;
    4,      7,      7,      10,     10,     13,     13,     16;
    1.0,    2.0,    1.8,    2.9,    2.7,    3.8,    3.8,    5.3;
    0.6,    0.8,    1.0,    1.0,    1.2,    1.4,    1.4,    1.4];
key = LuT(2:end, LuT(1,:) == d_sh);
key_b = key(1);
key_h = key(2);
key_D = key(3);
key_t1 = key(4);
key_t2 = key(5);
% поиск минимальной длины шпонки
sig_cr_lim = 150; % MPa, для ступицы из стали
L_key_min = 2 * T2 / d_sh / (key_h - key_t1) / sig_cr_lim; % mm

%% Расчет на прочность винтового соединения
% Таблица составлена по 
% ГОСТу 1491-80 (шаг резьбы), 
% ГОСТу 16093-2004 ("короткая" длина свинчивания)
LuT = [
    1,      2,      3,      4,      5,      6;
    93,     258,    551,    706,    1135,   1259;
    0.25,   0.4,    0.5,    0.7,    0.8,    1.0;
    0.6,    1.0,    1.5,    2.0,    2.5,    3.0];
d = 2; % mm
scr = LuT(2:end, LuT(1,:) == d);
Q = scr(1); % N, усилие затяжки
p_thr = scr(2); % mm, шаг резьбы
l_S = d % длина свинчивания
d1 = 0.8 * d;

K = 2.3; % коэффициент запаса (средний из диапазона 1.5..3.1)
% По ГОСТу 1759.0-87, 23 группа сталей (например, 20Х13)
sig_T_scr = 540; % MPa
% закаленный и состаренный Д16 сплав
sig_T_plate = 350; % MPa
sig_br_lim_plate = sig_T_plate / K;


% Проверка на разрыв
F_scr = pi * d1^2 / 4; % mm^2
sig_br = 1.3 * Q / F_scr
sig_br_lim = sig_T_scr / K

% Проверка на срез
tau_sl = Q / pi / d / 0.88 / l_S
tau_sl_lim = 0.75 * sig_br_lim_plate

% Проверка на смятие
sig_cr = 4 * Q / pi / (d^2 - d1^2) / (l_S / p_thr)
sig_cr_lim = 0.4 * sig_br_lim_plate